
## :x: Apply Failed

[CI link](https://github.com/goda6565/portfolio/actions/runs/15153155790)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service will be created
  + resource "google_cloud_run_v2_service" "cloudrun_service" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "frontend-feat"
      + observed_generation     = (known after apply)
      + project                 = "portfolio-460206"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "nginx:latest"

              + ports {
                  + container_port = 80
                  + name           = (known after apply)
                }

              + resources (known after apply)

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 1
              + min_instance_count = 0
            }
        }

      + traffic (known after apply)
    }

  # module.cloudrun_service.google_cloud_run_v2_service_iam_member.public_access will be created
  + resource "google_cloud_run_v2_service_iam_member" "public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = "allUsers"
      + name     = "frontend-feat"
      + project  = "portfolio-460206"
      + role     = "roles/run.invoker"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Creating...
╷
│ Error: Error creating Service: googleapi: Error 409: Resource 'frontend-feat' already exists.
│ 
│   with module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service,
│   on ../../modules/cloudrun/google_cloud_run_v2_service.tf line 1, in resource "google_cloud_run_v2_service" "cloudrun_service":
│    1: resource "google_cloud_run_v2_service" "cloudrun_service" {
│ 
╵
Releasing state lock. This may take a few moments...
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":31,"Program":"tfcmt","SHA1":"dfeee24bbd34b0fed3fab2bfa9a463c194cf72f5","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->